#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.config_bucket.random_id.this: Refreshing state... [id=aPbH]
module.logging_bucket.random_id.this: Refreshing state... [id=SssY]
module.remote_state_bucket.random_id.this: Refreshing state... [id=WvCN]
module.postgres_backups_bucket.random_id.this: Refreshing state... [id=Ze9c]
module.hackathon_bucket.random_id.this: Refreshing state... [id=kJkL]
module.telemetry.aws_security_group.this: Refreshing state... [id=sg-0fe1016110f628d78]
module.telemetry.aws_ebs_volume.extra[0]: Refreshing state... [id=vol-0b17032162769beef]
module.telemetry.aws_iam_role_policy_attachment.this: Refreshing state... [id=telemetry-role-20250913201130912800000001]
module.telemetry.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-103993986]
module.telemetry.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-4049716415]
module.telemetry.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/telemetry-policy]
module.telemetry.aws_iam_role.this: Refreshing state... [id=telemetry-role]
module.telemetry.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-1779365044]
module.telemetry.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1873260856]
module.telemetry.aws_eip.this: Refreshing state... [id=eipalloc-063023852781311db]
module.telemetry.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-2175988618]
module.telemetry.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-487672960]
module.telemetry.aws_volume_attachment.extra[0]: Refreshing state... [id=vai-3432725701]
aws_sns_topic.expense_analysis_completions: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:expense-analysis-completions]
module.telemetry.aws_security_group_rule.allow_inbound_http[0]: Refreshing state... [id=sgrule-943825833]
module.telemetry.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-3455326928]
module.telemetry.aws_iam_instance_profile.this: Refreshing state... [id=telemetry-instance-profile]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
module.repositories["ticket-tracker"].aws_iam_user.builder: Refreshing state... [id=ticket-tracker-builder]
module.telemetry.aws_instance.this: Refreshing state... [id=i-0fc58049b67cf509e]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
data.aws_caller_identity.current: Reading...
module.telemetry2.data.aws_iam_policy_document.ec2_assume_role: Reading...
module.telemetry2.data.aws_iam_policy_document.ec2_assume_role: Read complete after 0s [id=2851119427]
aws_route53_zone.forkup: Refreshing state... [id=Z06686303IG6BF3DZ1HIL]
module.repositories["ticket-tracker"].aws_ecr_repository.this: Refreshing state... [id=ticket-tracker]
module.hackathon_bucket.aws_s3_bucket.this: Refreshing state... [id=hackathon-90990b]
data.aws_caller_identity.current: Read complete after 0s [id=558855412466]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
module.primary.data.aws_iam_policy_document.ec2_assume_role: Reading...
module.primary.data.aws_iam_policy_document.ec2_assume_role: Read complete after 0s [id=2851119427]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
aws_sqs_queue.expense_analysis_completions: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/558855412466/expense-analysis-completions]
module.database.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/database-policy]
module.logging_bucket.aws_s3_bucket.this: Refreshing state... [id=logging-4acb18]
module.config_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-68f6c7]
module.postgres_backups_bucket.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-65ef5c]
module.personal.aws_iam_user.this: Refreshing state... [id=alex.jackson]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
module.database.data.aws_iam_policy_document.ec2_assume_role: Reading...
module.database.data.aws_iam_policy_document.ec2_assume_role: Read complete after 0s [id=2851119427]
aws_sns_topic.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages]
module.remote_state_bucket.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-5af08d]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
module.repositories["ticket-tracker"].aws_iam_access_key.builder: Refreshing state... [id=AKIAYEHTA3LZAHS7ZJVQ]
module.primary.aws_iam_role.this: Refreshing state... [id=primary-role]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
module.personal.aws_iam_user_login_profile.this: Refreshing state... [id=alex.jackson]
module.personal.aws_iam_access_key.this: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
module.database.aws_iam_role.this: Refreshing state... [id=database-role]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
module.repositories["ticket-tracker"].aws_iam_user_policy.builder: Refreshing state... [id=ticket-tracker-builder:ticket-tracker-builder-policy]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_sns_topic_subscription.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages:c15a0919-9e06-484e-bef6-08ab63e662d8]
aws_sns_topic_subscription.expense_analysis_completions: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:expense-analysis-completions:99889508-405a-4819-ad5e-d178d1865649]
aws_iam_policy.forkup_dev_policy: Refreshing state... [id=arn:aws:iam::558855412466:policy/forkup-dev-policy]
aws_iam_role.forkup_dev: Refreshing state... [id=forkup-dev]
module.primary.aws_iam_instance_profile.this: Refreshing state... [id=primary-instance-profile]
module.primary.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/primary-policy]
module.personal.aws_iam_user_policy.this: Refreshing state... [id=alex.jackson:alex.jackson.policy]
module.database.aws_iam_instance_profile.this: Refreshing state... [id=database-instance-profile]
module.database.aws_iam_role_policy_attachment.this: Refreshing state... [id=database-role-20231230120447701700000002]
aws_iam_role_policy_attachment.forkup_dev: Refreshing state... [id=forkup-dev-20250525170906426100000001]
module.primary.aws_iam_role_policy_attachment.this: Refreshing state... [id=primary-role-20250820060224303200000002]
aws_subnet.telemetry: Refreshing state... [id=subnet-0d0de9d8e515a9361]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
aws_route53_zone.internal: Refreshing state... [id=Z09687762HVZPD80UEWTJ]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.primary.aws_security_group.this: Refreshing state... [id=sg-005a27794033c70f3]
module.primary.data.aws_subnet.self: Reading...
module.database.data.aws_subnet.self: Reading...
module.database.aws_ebs_volume.this: Refreshing state... [id=vol-0ac43ea68879b3895]
module.database.aws_security_group.this: Refreshing state... [id=sg-0998f7db6e1ffb7eb]
module.primary.data.aws_subnet.self: Read complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.telemetry2.data.aws_subnet.inbound_http[0]: Reading...
module.database.data.aws_subnet.self: Read complete after 0s [id=subnet-07936cc0e5c7d83b1]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
aws_route_table_association.telemetry_gateway: Refreshing state... [id=rtbassoc-0fbb0a7746673cdd9]
module.primary.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-83461896]
module.primary.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-3378590203]
module.primary.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-2694514649]
module.telemetry2.data.aws_subnet.inbound_http[0]: Read complete after 1s [id=subnet-07936cc0e5c7d83b1]
module.primary.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-2343985178]
module.primary.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-1741088805]
module.primary.aws_instance.this: Refreshing state... [id=i-0821a23d68465c004]
module.primary.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-2363314913]
module.primary.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-2950014527]
module.telemetry2.data.aws_subnet.self: Reading...
module.hackathon_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=hackathon-90990b]
module.database.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-1306823711]
module.database.aws_security_group_rule.allow_inbound_postgres: Refreshing state... [id=sgrule-3465932672]
module.database.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-1983782041]
module.database.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-3173870365]
module.database.aws_instance.this: Refreshing state... [id=i-0e48bcc2a0d16252e]
module.postgres_backups_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-65ef5c]
module.telemetry2.data.aws_subnet.self: Read complete after 0s [id=subnet-0d0de9d8e515a9361]
module.config_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-68f6c7]
module.logging_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=logging-4acb18]
module.remote_state_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-5af08d]
aws_security_group_rule.allow_inbound_connections_from_primary: Refreshing state... [id=sgrule-968346915]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
aws_route53_record.telemetry: Refreshing state... [id=Z09687762HVZPD80UEWTJ_telemetry_A]
aws_route53_record.telemetry_records["telemetry"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_telemetry_A]
module.primary.aws_eip.this: Refreshing state... [id=eipalloc-0ff07352282ce68ad]
aws_route53_record.records["tags"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_tags_A]
aws_route53_record.records["today"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_today_A]
aws_route53_record.records["uptime"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_uptime_A]
aws_route53_record.records[""]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]
aws_route53_record.forkup_records[""]: Refreshing state... [id=Z06686303IG6BF3DZ1HIL__A]
module.database.aws_volume_attachment.this: Refreshing state... [id=vai-3516952077]
aws_route53_record.database: Refreshing state... [id=Z09687762HVZPD80UEWTJ_postgres_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.telemetry will be updated in-place
  ~ resource "aws_route53_record" "telemetry" {
        id                               = "Z09687762HVZPD80UEWTJ_telemetry_A"
        name                             = "telemetry"
      ~ records                          = [
          - "10.0.64.146",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_route53_record.telemetry_records["telemetry"] will be updated in-place
  ~ resource "aws_route53_record" "telemetry_records" {
        id                               = "Z03017682LQ8TW5YUFGE0_telemetry_A"
        name                             = "telemetry"
      ~ records                          = [
          - "54.228.155.222",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.telemetry.aws_ebs_volume.extra[0] will be destroyed
  # (because aws_ebs_volume.extra is not in configuration)
  - resource "aws_ebs_volume" "extra" {
      - arn                  = "arn:aws:ec2:eu-west-1:558855412466:volume/vol-0b17032162769beef" -> null
      - availability_zone    = "eu-west-1a" -> null
      - encrypted            = true -> null
      - final_snapshot       = false -> null
      - id                   = "vol-0b17032162769beef" -> null
      - iops                 = 3000 -> null
      - kms_key_id           = "arn:aws:kms:eu-west-1:558855412466:key/76e658b4-2ace-4918-ba15-1de9640d8c3e" -> null
      - multi_attach_enabled = false -> null
      - size                 = 10 -> null
      - tags                 = {
          - "Name" = "telemetry-extra-volume"
        } -> null
      - tags_all             = {
          - "Name" = "telemetry-extra-volume"
        } -> null
      - throughput           = 125 -> null
      - type                 = "gp3" -> null
        # (2 unchanged attributes hidden)
    }

  # module.telemetry.aws_eip.this will be destroyed
  # (because aws_eip.this is not in configuration)
  - resource "aws_eip" "this" {
      - allocation_id            = "eipalloc-063023852781311db" -> null
      - association_id           = "eipassoc-06bd4ae05bd8ab45f" -> null
      - domain                   = "vpc" -> null
      - id                       = "eipalloc-063023852781311db" -> null
      - instance                 = "i-0fc58049b67cf509e" -> null
      - network_border_group     = "eu-west-1" -> null
      - network_interface        = "eni-05750c2dcde8462a5" -> null
      - private_dns              = "ip-10-0-64-146.eu-west-1.compute.internal" -> null
      - private_ip               = "10.0.64.146" -> null
      - public_dns               = "ec2-54-228-155-222.eu-west-1.compute.amazonaws.com" -> null
      - public_ip                = "54.228.155.222" -> null
      - public_ipv4_pool         = "amazon" -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
      - vpc                      = true -> null
        # (3 unchanged attributes hidden)
    }

  # module.telemetry.aws_iam_instance_profile.this will be destroyed
  # (because aws_iam_instance_profile.this is not in configuration)
  - resource "aws_iam_instance_profile" "this" {
      - arn         = "arn:aws:iam::558855412466:instance-profile/telemetry-instance-profile" -> null
      - create_date = "2025-09-13T20:11:30Z" -> null
      - id          = "telemetry-instance-profile" -> null
      - name        = "telemetry-instance-profile" -> null
      - path        = "/" -> null
      - role        = "telemetry-role" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
      - unique_id   = "AIPAYEHTA3LZID5BE6NO5" -> null
        # (1 unchanged attribute hidden)
    }

  # module.telemetry.aws_iam_policy.this will be destroyed
  # (because aws_iam_policy.this is not in configuration)
  - resource "aws_iam_policy" "this" {
      - arn         = "arn:aws:iam::558855412466:policy/telemetry-policy" -> null
      - description = "Policy for telemetry-role" -> null
      - id          = "arn:aws:iam::558855412466:policy/telemetry-policy" -> null
      - name        = "telemetry-policy" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::configuration-68f6c7"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::configuration-68f6c7/*"
                    },
                  - {
                      - Action   = [
                          - "route53:ListHostedZones",
                          - "route53:GetChange",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "route53:ChangeResourceRecordSets",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:route53:::hostedzone/Z03017682LQ8TW5YUFGE0",
                          - "arn:aws:route53:::hostedzone/Z06686303IG6BF3DZ1HIL",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::logging-4acb18"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::logging-4acb18/*"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::postgres-backups-65ef5c/*"
                    },
                  - {
                      - Action   = [
                          - "sns:Publish",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:eu-west-1:558855412466:outages"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::hackathon-90990b/*"
                    },
                  - {
                      - Action   = [
                          - "textract:AnalyzeExpense",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAYEHTA3LZNMLQ3J5NL" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
        # (1 unchanged attribute hidden)
    }

  # module.telemetry.aws_iam_role.this will be destroyed
  # (because aws_iam_role.this is not in configuration)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::558855412466:role/telemetry-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-09-13T20:11:30Z" -> null
      - description           = "Role for the telemetry instance" -> null
      - force_detach_policies = false -> null
      - id                    = "telemetry-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::558855412466:policy/telemetry-policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "telemetry-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAYEHTA3LZH6W6MLOPI" -> null
        # (2 unchanged attributes hidden)
    }

  # module.telemetry.aws_iam_role_policy_attachment.this will be destroyed
  # (because aws_iam_role_policy_attachment.this is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "telemetry-role-20250913201130912800000001" -> null
      - policy_arn = "arn:aws:iam::558855412466:policy/telemetry-policy" -> null
      - role       = "telemetry-role" -> null
    }

  # module.telemetry.aws_instance.this will be destroyed
  # (because aws_instance.this is not in configuration)
  - resource "aws_instance" "this" {
      - ami                                  = "ami-0ab14756db2442499" -> null
      - arn                                  = "arn:aws:ec2:eu-west-1:558855412466:instance/i-0fc58049b67cf509e" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "eu-west-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "telemetry-instance-profile" -> null
      - id                                   = "i-0fc58049b67cf509e" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.medium" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "macbook-m2-pro" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-05750c2dcde8462a5" -> null
      - private_dns                          = "ip-10-0-64-146.eu-west-1.compute.internal" -> null
      - private_ip                           = "10.0.64.146" -> null
      - public_dns                           = "ec2-54-228-155-222.eu-west-1.compute.amazonaws.com" -> null
      - public_ip                            = "54.228.155.222" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0d0de9d8e515a9361" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
      - tenancy                              = "default" -> null
      - user_data                            = "f4dafbe581c12d621a19317224fbfc4cde3b3be7" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0fe1016110f628d78",
        ] -> null
        # (6 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdf" -> null
          - encrypted             = true -> null
          - iops                  = 3000 -> null
          - kms_key_id            = "arn:aws:kms:eu-west-1:558855412466:key/76e658b4-2ace-4918-ba15-1de9640d8c3e" -> null
          - tags                  = {
              - "Name" = "telemetry-extra-volume"
            } -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0b17032162769beef" -> null
          - volume_size           = 10 -> null
          - volume_type           = "gp3" -> null
            # (1 unchanged attribute hidden)
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0b46f8135acb75f93" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.telemetry.aws_security_group.this will be destroyed
  # (because aws_security_group.this is not in configuration)
  - resource "aws_security_group" "this" {
      - arn                    = "arn:aws:ec2:eu-west-1:558855412466:security-group/sg-0fe1016110f628d78" -> null
      - description            = "Security group for the telemetry f2-instance" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow outbound HTTP to anywhere"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow outbound HTTPS to anywhere"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow outbound SSH to anywhere"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "10.0.64.0/24",
                ]
              - description      = "Allow outbound Postgres to the subnet"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
          - {
              - cidr_blocks      = [
                  - "64.227.33.121/32",
                ]
              - description      = "Allow outbound Postgres to the Digital Ocean instance"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - id                     = "sg-0fe1016110f628d78" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow inbound HTTPS from anywhere"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow inbound SSH from anywhere"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/24",
                ]
              - description      = "Allow inbound http from the specified subnet"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "telemetry-f2-instance" -> null
      - owner_id               = "558855412466" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0d1ab7c53aec22955" -> null
        # (1 unchanged attribute hidden)
    }

  # module.telemetry.aws_security_group_rule.allow_inbound_http[0] will be destroyed
  # (because aws_security_group_rule.allow_inbound_http is not in configuration)
  - resource "aws_security_group_rule" "allow_inbound_http" {
      - cidr_blocks            = [
          - "10.0.0.0/24",
        ] -> null
      - description            = "Allow inbound http from the specified subnet" -> null
      - from_port              = 80 -> null
      - id                     = "sgrule-943825833" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-0fe1016110f628d78" -> null
      - security_group_rule_id = "sgr-0ebba4c8ab52c31bf" -> null
      - self                   = false -> null
      - to_port                = 80 -> null
      - type                   = "ingress" -> null
    }

  # module.telemetry.aws_security_group_rule.allow_inbound_https will be destroyed
  # (because aws_security_group_rule.allow_inbound_https is not in configuration)
  - resource "aws_security_group_rule" "allow_inbound_https" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow inbound HTTPS from anywhere" -> null
      - from_port              = 443 -> null
      - id                     = "sgrule-2175988618" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-0fe1016110f628d78" -> null
      - security_group_rule_id = "sgr-00900144f482f09f9" -> null
      - self                   = false -> null
      - to_port                = 443 -> null
      - type                   = "ingress" -> null
    }

  # module.telemetry.aws_security_group_rule.allow_inbound_ssh will be destroyed
  # (because aws_security_group_rule.allow_inbound_ssh is not in configuration)
  - resource "aws_security_group_rule" "allow_inbound_ssh" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow inbound SSH from anywhere" -> null
      - from_port              = 22 -> null
      - id                     = "sgrule-1873260856" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-0fe1016110f628d78" -> null
      - security_group_rule_id = "sgr-0d433a5b236a3056e" -> null
      - self                   = false -> null
      - to_port                = 22 -> null
      - type                   = "ingress" -> null
    }

  # module.telemetry.aws_security_group_rule.allow_outbound_http will be destroyed
  # (because aws_security_group_rule.allow_outbound_http is not in configuration)
  - resource "aws_security_group_rule" "allow_outbound_http" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow outbound HTTP to anywhere" -> null
      - from_port              = 80 -> null
      - id                     = "sgrule-4049716415" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-0fe1016110f628d78" -> null
      - security_group_rule_id = "sgr-0844cf727dbe48133" -> null
      - self                   = false -> null
      - to_port                = 80 -> null
      - type                   = "egress" -> null
    }

  # module.telemetry.aws_security_group_rule.allow_outbound_https will be destroyed
  # (because aws_security_group_rule.allow_outbound_https is not in configuration)
  - resource "aws_security_group_rule" "allow_outbound_https" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow outbound HTTPS to anywhere" -> null
      - from_port              = 443 -> null
      - id                     = "sgrule-103993986" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-0fe1016110f628d78" -> null
      - security_group_rule_id = "sgr-00900144f482f09f9" -> null
      - self                   = false -> null
      - to_port                = 443 -> null
      - type                   = "egress" -> null
    }

  # module.telemetry.aws_security_group_rule.allow_outbound_postgres will be destroyed
  # (because aws_security_group_rule.allow_outbound_postgres is not in configuration)
  - resource "aws_security_group_rule" "allow_outbound_postgres" {
      - cidr_blocks            = [
          - "64.227.33.121/32",
        ] -> null
      - description            = "Allow outbound Postgres to the Digital Ocean instance" -> null
      - from_port              = 5432 -> null
      - id                     = "sgrule-3455326928" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-0fe1016110f628d78" -> null
      - security_group_rule_id = "sgr-06a8157218e88fb0d" -> null
      - self                   = false -> null
      - to_port                = 5432 -> null
      - type                   = "egress" -> null
    }

  # module.telemetry.aws_security_group_rule.allow_outbound_ssh will be destroyed
  # (because aws_security_group_rule.allow_outbound_ssh is not in configuration)
  - resource "aws_security_group_rule" "allow_outbound_ssh" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow outbound SSH to anywhere" -> null
      - from_port              = 22 -> null
      - id                     = "sgrule-487672960" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-0fe1016110f628d78" -> null
      - security_group_rule_id = "sgr-0d433a5b236a3056e" -> null
      - self                   = false -> null
      - to_port                = 22 -> null
      - type                   = "egress" -> null
    }

  # module.telemetry.aws_security_group_rule.allow_outbound_subnet_postgres will be destroyed
  # (because aws_security_group_rule.allow_outbound_subnet_postgres is not in configuration)
  - resource "aws_security_group_rule" "allow_outbound_subnet_postgres" {
      - cidr_blocks            = [
          - "10.0.64.0/24",
        ] -> null
      - description            = "Allow outbound Postgres to the subnet" -> null
      - from_port              = 5432 -> null
      - id                     = "sgrule-1779365044" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-0fe1016110f628d78" -> null
      - security_group_rule_id = "sgr-0e85947714cfe4665" -> null
      - self                   = false -> null
      - to_port                = 5432 -> null
      - type                   = "egress" -> null
    }

  # module.telemetry.aws_volume_attachment.extra[0] will be destroyed
  # (because aws_volume_attachment.extra is not in configuration)
  - resource "aws_volume_attachment" "extra" {
      - device_name = "/dev/sdf" -> null
      - id          = "vai-3432725701" -> null
      - instance_id = "i-0fc58049b67cf509e" -> null
      - volume_id   = "vol-0b17032162769beef" -> null
    }

  # module.telemetry2.aws_ebs_volume.extra[0] will be created
  + resource "aws_ebs_volume" "extra" {
      + arn               = (known after apply)
      + availability_zone = (known after apply)
      + encrypted         = true
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 10
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Name" = "telemetry2-extra-volume"
        }
      + tags_all          = {
          + "Name" = "telemetry2-extra-volume"
        }
      + throughput        = (known after apply)
      + type              = "gp3"
    }

  # module.telemetry2.aws_eip.this will be created
  + resource "aws_eip" "this" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = (known after apply)
    }

  # module.telemetry2.aws_iam_instance_profile.this will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "telemetry2-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "telemetry2-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.telemetry2.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + description = "Policy for telemetry2-role"
      + id          = (known after apply)
      + name        = "telemetry2-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::configuration-68f6c7"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::configuration-68f6c7/*"
                    },
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                          + "route53:GetChange",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:route53:::hostedzone/Z03017682LQ8TW5YUFGE0",
                          + "arn:aws:route53:::hostedzone/Z06686303IG6BF3DZ1HIL",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::logging-4acb18"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::logging-4acb18/*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::postgres-backups-65ef5c/*"
                    },
                  + {
                      + Action   = [
                          + "sns:Publish",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sns:eu-west-1:558855412466:outages"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::hackathon-90990b/*"
                    },
                  + {
                      + Action   = [
                          + "textract:AnalyzeExpense",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.telemetry2.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for the telemetry2 instance"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "telemetry2-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.telemetry2.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "telemetry2-role"
    }

  # module.telemetry2.aws_instance.this will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0ab14756db2442499"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "telemetry2-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "macbook-m2-pro"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0d0de9d8e515a9361"
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "f4dafbe581c12d621a19317224fbfc4cde3b3be7"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.telemetry2.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for the telemetry2 f2-instance"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "telemetry2-f2-instance"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0d1ab7c53aec22955"
    }

  # module.telemetry2.aws_security_group_rule.allow_inbound_http[0] will be created
  + resource "aws_security_group_rule" "allow_inbound_http" {
      + cidr_blocks              = [
          + "10.0.0.0/24",
        ]
      + description              = "Allow inbound http from the specified subnet"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.telemetry2.aws_security_group_rule.allow_inbound_https will be created
  + resource "aws_security_group_rule" "allow_inbound_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow inbound HTTPS from anywhere"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.telemetry2.aws_security_group_rule.allow_inbound_ssh will be created
  + resource "aws_security_group_rule" "allow_inbound_ssh" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow inbound SSH from anywhere"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.telemetry2.aws_security_group_rule.allow_outbound_http will be created
  + resource "aws_security_group_rule" "allow_outbound_http" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow outbound HTTP to anywhere"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.telemetry2.aws_security_group_rule.allow_outbound_https will be created
  + resource "aws_security_group_rule" "allow_outbound_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow outbound HTTPS to anywhere"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.telemetry2.aws_security_group_rule.allow_outbound_postgres will be created
  + resource "aws_security_group_rule" "allow_outbound_postgres" {
      + cidr_blocks              = [
          + "64.227.33.121/32",
        ]
      + description              = "Allow outbound Postgres to the Digital Ocean instance"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "egress"
    }

  # module.telemetry2.aws_security_group_rule.allow_outbound_ssh will be created
  + resource "aws_security_group_rule" "allow_outbound_ssh" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow outbound SSH to anywhere"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # module.telemetry2.aws_security_group_rule.allow_outbound_subnet_postgres will be created
  + resource "aws_security_group_rule" "allow_outbound_subnet_postgres" {
      + cidr_blocks              = [
          + "10.0.64.0/24",
        ]
      + description              = "Allow outbound Postgres to the subnet"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "egress"
    }

  # module.telemetry2.aws_volume_attachment.extra[0] will be created
  + resource "aws_volume_attachment" "extra" {
      + device_name = "/dev/sdf"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = (known after apply)
    }

Plan: 17 to add, 2 to change, 17 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>